// Универсальная программа введения в степень числа
// Console.Write ("введите целое число: ");
// int num = Convert.ToInt32 (Console.ReadLine());
// double square = Math.Pow (num, 5);
// Console.Write ($"Квадрат числа {num} - {square}");


// Напишите программу, которая на вход принимает число и выдает его квадрат (число умножает на само себя)
// Например: 4 -> 16, 3 -> 9, -7 -> 49


Console.Write ("введите целое число: ");
int num = Convert.ToInt32 (Console.ReadLine());
int square = num*num;
Console.Write ($"Квадрат числа {num} - {square}");

// if (num > 5)
// {
//     Console.WriteLine("ОК!");
// }
// else Console.WriteLine("Ошибка!");
// while (num > 5)
// {

// }
// double d = 5.55;
// int i = (int)d;
// Console.WriteLine(i);
// Console.Write ($"Квадрат числа {num} - {square}");


